billing_cf/InformationRegisters/энргЗначенияТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСверхНорматива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРЭК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПотребителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/InformationRegisters/энргЗначенияТарифов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет значения текущих тарифов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция ЗначенияТекущихТарифов(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияТарифов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ГруппаПотребителей, Услуга, Поставщик, ТарифнаяЗона";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Пакет.Операторы[0].Отбор.Очистить();
				СоотвествиеПолей 			= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
				ОтборДляУстановки 			= Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,"ТипПараметраВременнаяТаблица", СоотвествиеПолей);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргЗначенияТарифовСрезПоследних",ОтборДляУстановки, "");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	 	
		
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции

// Заполняет значения текущих тарифов коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначенияТекущихТарифовКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияТекущихТарифовКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ГруппаПотребителей, Услуга, Поставщик, ТарифнаяЗона";
		ИмяТаблицы 					= "ЗначенияТарифов";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет изменение тарифов в периоде.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ИзменениеТарифовВПериоде(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаИзменениеТарифовВПериоде());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ГруппаПотребителей, Услуга, Поставщик, ТарифнаяЗона";
		ИмяТаблицы 					= "энргЗначенияТарифовЗаписи";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет изменение тарифов в периоде коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка
//
Процедура ИзменениеТарифовВПериодеКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаИзменениеТарифовВПериодеКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ГруппаПотребителей, Услуга, Поставщик, ТарифнаяЗона";
		ИмяТаблицы 					= "ЗначенияТарифов";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет схему тарифные группы текущий значений.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуТарифныеГруппыТекущийЗначений(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуТарифныеГруппыТекущийЗначений());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ГруппаПотребителей, Услуга, Поставщик, ТарифнаяЗона";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Пакет.Операторы[0].Отбор.Очистить();
				СоотвествиеПолей 			= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
				ОтборДляУстановки 			= Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,"ТипПараметраВременнаяТаблица", СоотвествиеПолей);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргЗначенияТарифовСрезПоследних",ОтборДляУстановки, "");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	 	
			
КонецПроцедуры

// Заполняет значения тарифов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначенияТарифов(Схема,Параметры, ТаблицаДляПомещения = "ЗначенияТарифовНабор") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли;	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТаблицаЗначенийТарифовСоставныхУслугПомещений());
	Пакет.ТаблицаДляПомещения  		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	ПараметрыТаблицы				= Источник.Параметры;	
	ПараметрПериод 					= ПараметрыТаблицы[0];
	
	Если Параметры.Свойство("Период") Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",Параметры["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ГруппаПотребителей, Услуга, Поставщик, ТарифнаяЗона";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],Параметры.ПараметрыВТ,ДоступныеПараметры)
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если Параметры.Свойство("ВыбиратьВсеПоля") И Параметры.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает текст запроса на получение значения тарифов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаЗначенияТарифов() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргЗначенияТарифовСрезПоследних.Организация КАК Организация,
	|	энргЗначенияТарифовСрезПоследних.Район КАК Район,
	|	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик,
	|	энргЗначенияТарифовСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК Значение,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеРЭК КАК ЗначениеРЭК
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов.СрезПоследних КАК энргЗначенияТарифовСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

// Возвращает текст запроса на получение значения текущих тарифов коллекция периодов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаЗначенияТекущихТарифовКоллекцияПериодов() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЗначенияТарифов.Значение КАК Значение,
	|	ЗначенияТарифов.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	ЗначенияТарифов.СтавкаНДС КАК СтавкаНДС,
	|	ЗначенияТарифов.НДСВнутри КАК НДСВнутри,
	|	ЗначенияТарифов.ЗначениеРЭК КАК ЗначениеРЭК
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		ЗначенияТарифов.Организация КАК Организация,
	|		ЗначенияТарифов.Район КАК Район,
	|		ЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|		ЗначенияТарифов.Услуга КАК Услуга,
	|		ЗначенияТарифов.Поставщик КАК Поставщик,
	|		ЗначенияТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|		МАКСИМУМ(ЗначенияТарифов.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргЗначенияТарифов КАК ЗначенияТарифов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО ЗначенияТарифов.Организация = ТаблицаПериодов.Организация
	|				И ЗначенияТарифов.Район = ТаблицаПериодов.Район
	|				И ЗначенияТарифов.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		ЗначенияТарифов.Организация,
	|		ЗначенияТарифов.Район,
	|		ЗначенияТарифов.ГруппаПотребителей,
	|		ЗначенияТарифов.Услуга,
	|		ЗначенияТарифов.Поставщик,
	|		ЗначенияТарифов.ТарифнаяЗона) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК ЗначенияТарифов
	|		ПО ВложенныйЗапрос.Организация = ЗначенияТарифов.Организация
	|			И ВложенныйЗапрос.Район = ЗначенияТарифов.Район
	|			И ВложенныйЗапрос.ГруппаПотребителей = ЗначенияТарифов.ГруппаПотребителей
	|			И ВложенныйЗапрос.Услуга = ЗначенияТарифов.Услуга
	|			И ВложенныйЗапрос.Поставщик = ЗначенияТарифов.Поставщик
	|			И ВложенныйЗапрос.ТарифнаяЗона = ЗначенияТарифов.ТарифнаяЗона
	|			И ВложенныйЗапрос.Период = ЗначенияТарифов.Период";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаИзменениеТарифовВПериодеКоллекцияПериодов()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЗначенияТарифов.Значение КАК Значение,
	|	ЗначенияТарифов.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	ЗначенияТарифов.СтавкаНДС КАК СтавкаНДС,
	|	ЗначенияТарифов.НДСВнутри КАК НДСВнутри,
	|	ЗначенияТарифов.ЗначениеРЭК КАК ЗначениеРЭК,
	|	ДОБАВИТЬКДАТЕ(ВложенныйЗапрос.ПериодНачисления, ДЕНЬ, &ПериодНовогоТарифа - 1) КАК ДатаСменыТарифа
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		ТаблицаПериодов.НачалоОП КАК НачалоОП,
	|		ТаблицаПериодов.ЗавершениеОП КАК ЗавершениеОП,
	|		ЗначенияТарифов.Организация КАК Организация,
	|		ЗначенияТарифов.Район КАК Район,
	|		ЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|		ЗначенияТарифов.Услуга КАК Услуга,
	|		ЗначенияТарифов.Поставщик КАК Поставщик,
	|		ЗначенияТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|		МАКСИМУМ(ЗначенияТарифов.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргЗначенияТарифов КАК ЗначенияТарифов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО ЗначенияТарифов.Организация = ТаблицаПериодов.Организация
	|				И ЗначенияТарифов.Район = ТаблицаПериодов.Район
	|				И ЗначенияТарифов.Период < ТаблицаПериодов.НачалоОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		ТаблицаПериодов.НачалоОП,
	|		ТаблицаПериодов.ЗавершениеОП,
	|		ЗначенияТарифов.Организация,
	|		ЗначенияТарифов.Район,
	|		ЗначенияТарифов.ГруппаПотребителей,
	|		ЗначенияТарифов.Услуга,
	|		ЗначенияТарифов.Поставщик,
	|		ЗначенияТарифов.ТарифнаяЗона) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК ЗначенияТарифов
	|		ПО ВложенныйЗапрос.Организация = ЗначенияТарифов.Организация
	|			И ВложенныйЗапрос.Район = ЗначенияТарифов.Район
	|			И ВложенныйЗапрос.ГруппаПотребителей = ЗначенияТарифов.ГруппаПотребителей
	|			И ВложенныйЗапрос.Услуга = ЗначенияТарифов.Услуга
	|			И ВложенныйЗапрос.Поставщик = ЗначенияТарифов.Поставщик
	|			И ВложенныйЗапрос.ТарифнаяЗона = ЗначенияТарифов.ТарифнаяЗона
	|			И ВложенныйЗапрос.Период = ЗначенияТарифов.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК ИзмененияТарифаВПериоде
	|		ПО (ВложенныйЗапрос.Организация = ЗначенияТарифов.Организация)
	|			И (ВложенныйЗапрос.Район = ЗначенияТарифов.Район)
	|			И (ВложенныйЗапрос.ГруппаПотребителей = ЗначенияТарифов.ГруппаПотребителей)
	|			И (ВложенныйЗапрос.Услуга = ЗначенияТарифов.Услуга)
	|			И (ВложенныйЗапрос.Поставщик = ЗначенияТарифов.Поставщик)
	|			И (ВложенныйЗапрос.ТарифнаяЗона = ЗначенияТарифов.ТарифнаяЗона)
	|			И (ЗначенияТарифов.Период МЕЖДУ ВложенныйЗапрос.НачалоОП И ВложенныйЗапрос.ЗавершениеОП)
	|			И (&ПериодНовогоТарифа > 0)"; 
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаИзменениеТарифовВПериоде() 
	
	Текст  = 
	"ВЫБРАТЬ
	|	энргЗначенияТарифовЗаписи.Организация КАК Организация,
	|	энргЗначенияТарифовЗаписи.Район КАК Район,
	|	энргЗначенияТарифовЗаписи.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифовЗаписи.Услуга КАК Услуга,
	|	энргЗначенияТарифовЗаписи.Поставщик КАК Поставщик,
	|	энргЗначенияТарифовЗаписи.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЗначенияПредыдущихТарифов.Значение КАК Значение,
	|	ЗначенияПредыдущихТарифов.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	ЗначенияПредыдущихТарифов.ЗначениеРЭК КАК ЗначениеРЭК,
	|	энргЗначенияТарифовЗаписи.Регистратор КАК Регистратор,
	|	ДОБАВИТЬКДАТЕ(энргЗначенияТарифовЗаписи.Период, ДЕНЬ, &ПериодНовогоТарифа - 1) КАК ДатаСменыТарифа
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифовЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	|				&НачалоПериодаРасчета,
	|				Организация = &Организация
	|					И Район = &Район) КАК ЗначенияПредыдущихТарифов
	|		ПО энргЗначенияТарифовЗаписи.ГруппаПотребителей = ЗначенияПредыдущихТарифов.ГруппаПотребителей
	|			И энргЗначенияТарифовЗаписи.Услуга = ЗначенияПредыдущихТарифов.Услуга
	|			И энргЗначенияТарифовЗаписи.Поставщик = ЗначенияПредыдущихТарифов.Поставщик
	|			И энргЗначенияТарифовЗаписи.ТарифнаяЗона = ЗначенияПредыдущихТарифов.ТарифнаяЗона
	|			И (энргЗначенияТарифовЗаписи.Период МЕЖДУ &НачалоПериодаРасчета И ДОБАВИТЬКДАТЕ(&ЗавершениеПериодаРасчета, ДЕНЬ, -1))
	|			И (&ПериодНовогоТарифа > 0)"; 
	
	Возврат Текст;

	
КонецФункции

Функция ТекстЗапросаТаблицаЗначенийТарифовСоставныхУслугПомещений()
	
	Текст  =
	"ВЫБРАТЬ
	|	ЗначенияТарифов.Организация КАК Организация,
	|	ЗначенияТарифов.Район КАК Район,
	|	ЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ЗначенияТарифов.Услуга КАК Услуга,
	|	ЗначенияТарифов.Поставщик КАК Поставщик,
	|	ЗначенияТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЗначенияТарифов.Значение КАК Значение,
	|	ЗначенияТарифов.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	ЗначенияТарифов.СтавкаНДС КАК СтавкаНДС,
	|	ЗначенияТарифов.НДСВнутри КАК НДСВнутри,
	|	ЗначенияТарифов.ЗначениеРЭК КАК ЗначениеРЭК
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов.СрезПоследних КАК ЗначенияТарифов";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗаполнитьСхемуТарифныеГруппыТекущийЗначений()
	Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов.СрезПоследних КАК энргЗначенияТарифовСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
